---
type: WallSweep
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# WallSweep

`Autodesk.Revit.DB.WallSweep` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static WallSweep Create ( Wall wall , ElementId wallSweepType , WallSweepInfo wallSweepInfo )` |
| Method | GetHostIds | 2012 | `public IList < ElementId > GetHostIds ()` |
| Method | GetWallSweepInfo | 2012 | `public WallSweepInfo GetWallSweepInfo ()` |
| Method | WallAllowsWallSweep | 2012 | `public static bool WallAllowsWallSweep ( Wall wall )` |
| Property | Parameter | — | `` |